Revit 2026 API

# IndexStreamLineAddLines Method

---
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddLines(
	IList<IndexLine> lines
)
```
```vb
Public Sub AddLines (
	lines As IList(Of IndexLine)
)
```
```cpp
public:
void AddLines(
	IList<IndexLine^>^ lines
)
```
```fsharp
member AddLines :
        lines : IList<IndexLine> -> unit
```

#### Parameters

lines IListIndexLine

#### Reference

IndexStreamLine Class

Autodesk.Revit.DB.DirectContext3D Namespace